# What is Pandas?
python library for data manipulation and analysis

In [2]:
import pandas as pd
data_frame = pd.read_csv('data/friend_list.csv')

In [3]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# What is DataFrame?
dataframe is a 2-dimensional labeled data structure with columns

In [4]:
data_frame.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# What is Series?
Every single column in dataframe is series

In [5]:
type(data_frame.job)

pandas.core.series.Series

In [7]:
data_frame.job = data_frame.job.str.upper()
data_frame.head()

    name  age        job
0   John   20    STUDENT
1  Jenny   30  DEVELOPER
2   Nate   30    TEACHER
3  Julia   40    DENTIST
4  Brian   45    MANAGER

**Series** is just wrapper for python list

In [10]:
s1 = pd.core.series.Series(['one', 'two', 'three'])
s2 = pd.core.series.Series([1, 2, 3])
pd.DataFrame(data=dict(word=s1, num=s2))

   num   word
0    1    one
1    2    two
2    3  three

# Why Pandas?

Very similar to Excel spreadsheet view,  
support various functions for data manipulation and analysis.  
Fast based on Numpy.  
Easy to manipulate data for your purpose

# Read File to DataFrame
A **Data frame** is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

by default, pandas support csv format

In [429]:
df = pd.read_csv('data/friend_list.csv')

In [430]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

you can read txt file like below, if the txt file data are comma separated

In [431]:
df = pd.read_csv('data/friend_list.txt')

In [432]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

if txt file delimiter is not comma, you can use define delimiter using keyword argument

In [433]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter = "\t")

In [434]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

if data file doesn't have header,  
Use header = None like below, so first column not to be your column header

In [435]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [436]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager

you can add column header after you create dataframe

In [437]:
df.columns = ['name', 'age', 'job']

In [438]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

you can create column header for no header data at once

In [439]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])

In [440]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# Create DataFrame
when you want to create dataframe from your python code

## from dictionary

In [441]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [442]:
df.head()

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

if you need fixed column order, you can adjust column order like below,

In [443]:
df = df[['name', 'age', 'job']]

In [444]:
df.head()

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from OrderedDict
OrderedDict helps you to have fixed column order at once

In [445]:
from collections import OrderedDict

In [446]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
          ('age', [20, 30, 30]),
          ('job', ['student', 'developer', 'teacher']) ] )
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [447]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from list

In [448]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [449]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [450]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [451]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# Write DataFrame to File

here is one dataframe example with header

In [452]:
friend_list = [ 
                ['name',['John', 'Jenny', 'nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [453]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   nate   30    teacher

you can create csv file using below command,

In [454]:
df.to_csv('friend_list_from_df.csv')

below is one example of dataframe **doesn't** have header

In [455]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
df = pd.DataFrame.from_records(friend_list)

In [456]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

you can write csv file using below command,

In [457]:
df.to_csv('friend_list_from_df.csv')

you also can write txt file using same command

In [458]:
df.to_csv('friend_list_from_df.txt')

by default, header and index are True like below, even if you don't mention it in the command

In [459]:
df.to_csv('friend_list_from_df.csv', header = True, index = True)

**header = False** means you don't want to create column names. no 0,1,2 at column name   
**index = False** means you don't want to create row names.  no 0,1,2 at row name

In [460]:
df.to_csv('friend_list_from_df.csv', header = False, index = False)

you can specify add column names by giving **header** with list

In [461]:
df.to_csv('friend_list_from_df.csv', header = ['name', 'age', 'job'])

below is dataframe has **None** value

In [462]:
friend_list = [ 
                ['name',['John', None, 'nate']],
                ['age',[20,None,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [463]:
df.head()

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher

In [464]:
df.to_csv('friend_list_from_df.csv')

**na_rep** replace **None** with provided value

In [465]:
df.to_csv('friend_list_from_df.csv', na_rep = '-')

# Select Row

## by index

In [466]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [467]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

select rows from index 1 to index 2

In [468]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

select row index 0 and index 2

In [469]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [470]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## by column condition

In [471]:
df_filtered = df[df.age > 25]

In [472]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [473]:
df_filtered = df.query('age>25')

In [474]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [475]:
df_filtered = df[(df.age >25) & (df.name == 'Nate')]

In [476]:
df_filtered

   name  age      job
2  Nate   30  teacher

In [477]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# Filter Column

## by index

In [478]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

select all rows, from column 0 to column 1

In [479]:
df.iloc[:, 0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

select all rows, column 0 and column 2

In [480]:
df.iloc[:,[0,2]]

       0          2
0   John    student
1  Jenny  developer
2   Nate    teacher

In [481]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

## by column name

In [482]:
# you can create column header for no header data at once
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [483]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [484]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [485]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [486]:
# select columns containing 'a'
df.filter(like='a',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [487]:
# select columns using regex
df.filter(regex='b$',axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

# Drop rows

## by row name (index name)

In [488]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [489]:
df.head()

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

### drop row
dropped result will be shown, but dataframe keeps the dropped row

In [490]:
df.drop(['John', 'Nate'])

       age        job
Jenny   30  developer

In [491]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

you can assign the result to dataframe to keep the dropped result like below,

In [492]:
df = df.drop(['John', 'Nate'])

In [493]:
df

       age        job
Jenny   30  developer

### drop row in place
The dropped row will be deleted from dataframe with inplace keyword parameter

In [494]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [495]:
df.drop(['John', 'Nate'], inplace = True)

In [496]:
df

       age        job
Jenny   30  developer

## by row id (index number)

In [497]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [498]:
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

you can drop rows by its index

In [499]:
df = df.drop(df.index[[0,2]])

In [500]:
df

   age        job   name
1   30  developer  Jenny

## By Column value

In [501]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

In [502]:
df = df[df.age != 30]

In [503]:
df

   age      job  name
0   20  student  Jone

# Drop column

In [504]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

In [505]:
df = df.drop('age', axis=1)

In [506]:
df

         job   name
0    student   Jone
1  developer  Jenny
2    teacher   Nate

# Add Column

In [507]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

### Add New Column with default value

In [508]:
df['salary'] = 0

In [509]:
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

### Add New Column derived from existing value

In [510]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

#### one liner adding column by true or false condition

In [511]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student' , 'yes', 'no')

In [512]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [513]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

#### column derived from adding two existing columns

In [514]:
df['total'] = df['midterm'] + df['final']

In [515]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

#### columm from existing column

In [516]:
df['average'] = df['total'] / 2

In [517]:
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

#### column by conditional condition

In [518]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df['grade'] = grades

In [519]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

#### how to use apply function

In [520]:
def pass_or_fail(row):
    print(row)
    if row != "F":
        return 'Pass'
    else:
        return 'Fail'

In [521]:
df.grade = df.grade.apply(pass_or_fail)

A
B
F

In [522]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Fail

#### info extraction using df.apply

In [523]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [524]:
def extract_year(row):
    return row.split('-')[0]

In [525]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [526]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

# Add Row

In [527]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [528]:
df2 = pd.DataFrame([['Ben', 50,50]], columns = ['name', 'midterm', 'final'])

In [529]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [530]:
df.append(df2, ignore_index=True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3    Ben       50     50

# Group by
group by command helps to get more information from given data

In [531]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [532]:
groupby_major = df.groupby('major')

In [533]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

here we can see, computer science has mostly man, while economic has mostly woman students

In [534]:
for name, group in groupby_major:
    print(name + ": " + str(len(group)))
    print(group)
    print()

Computer Science: 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics: 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics: 1
      name    major   sex
2  Abraham  Physics  male

Psychology: 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

### group object to dataframe

In [535]:
df_major_cnt = pd.DataFrame({'count' : groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [536]:
groupby_sex = df.groupby('sex')

here we can see, this school has balanced woman and man ratio

In [537]:
for name, group in groupby_sex:
    print(name + ": " + str(len(group)))
    print(group)
    print()

female: 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male: 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [538]:
df_sex_cnt = pd.DataFrame({'count' : groupby_sex.size()}).reset_index()
df_sex_cnt

      sex  count
0  female      6
1    male      5

# Drop Duplicate
sometimes you need to drop duplicate rows and here is elegant way to to it

In [539]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

## check if there is duplicated row

In [540]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [541]:
df = df.drop_duplicates()

In [542]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [543]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [544]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [545]:
df.drop_duplicates(['name'], keep='last')

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [546]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

# how to manage None value?

In [547]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

## how to check if there is Null or NaN

In [548]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
name    8 non-null object
job     8 non-null object
age     6 non-null float64
dtypes: float64(1), object(2)
memory usage: 272.0+ bytes

In [549]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [550]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

## how to fill Null or NaN

In [551]:
tmp = df
tmp["age"] = tmp["age"].fillna(0)
tmp

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [552]:
# fill missing age with median age for each group (teacher, student)
df["age"].fillna(df.groupby("job")["age"].transform("median"), inplace=True)

In [553]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0